package blocks.bricks {
	
	
	
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//																																	//
//	ИМПОРТ ПАКЕТОВ																													//
//																																	//
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	import blocks.Brick;
	import engine.Square;
	import flash.events.EventDispatcher;
	import flash.display.Sprite;
	import flash.events.Event;

	
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//																																	//
//	КИРПИЧИК - ТАНК																													//
//																																	//
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	public class Brick_4 extends Brick {



//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//																																	//
//		СВОЙСТВА КЛАССА																												//
//																																	//
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

		
		
		
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//																																	//
//		КОНСТРУКТОР КЛАССА																											//
//																																	//
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		public function Brick_4() {
					this._brickBlocks = new Array	(	new Array( 0 , -1 ),
											 			new Array( 0 , 0 ),
														new Array( -1 , 0 ),
														new Array( 1 , 0 )
													);
					super();
		}



//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//																																	//
//		КРУТИМ КУБИК																												//
//																																	//
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		override public function _rotate (_field:Array):void {
			var _newBrickBlocks:Array;
			
			switch ( this.rotation ) {
				case 0:
					_newBrickBlocks = new Array	(	new Array( 0 , -2 ),
											 		new Array( 0 , -1 ),
													new Array( -1 , -1 ),
													new Array( 0 , 0 )
												);
					break;
				case -90:
					_newBrickBlocks = new Array	(	new Array( -2 , -1 ),
											 		new Array( -1 , -1 ),
													new Array( 0 , -1 ),
													new Array( -1 , 0 )
												);
					break;
				case -180:
					_newBrickBlocks = new Array	(	new Array( -1 , -1 ),
											 		new Array( -1 , 0 ),
													new Array( -1 , 1 ),
													new Array( 0 , 0 )
												);
					break;
				case 90:
					_newBrickBlocks = new Array	(	new Array( 0 , -1 ),
											 		new Array( 0 , 0 ),
													new Array( -1 , 0 ),
													new Array( 1 , 0 )
											);
					break;
			}
			if ( this._squaresCheck ( _newBrickBlocks , _field ) ) {
				this.rotation -= 90;
				this._brickBlocks = _newBrickBlocks;
			}
		}		
	}
}